## Dictionary

In [4]:
students={ 'fname': ['Ali','Ahmed','Sana'],
           'lname': ['naeem','shan','muzamil'],
           'email': ['ali.naeem@jinnah.edu','ahmed.shan@jinnah.edu','sana.muzamil@jinnah.edu']   
}

In [5]:
students['email']

['ali.naeem@jinnah.edu', 'ahmed.shan@jinnah.edu', 'sana.muzamil@jinnah.edu']

## Data Frame

In [6]:
import pandas as pd

In [7]:
data=pd.DataFrame(students)

In [8]:
data

   fname    lname                    email
0    Ali    naeem     ali.naeem@jinnah.edu
1  Ahmed     shan    ahmed.shan@jinnah.edu
2   Sana  muzamil  sana.muzamil@jinnah.edu

In [9]:
data['email']

0       ali.naeem@jinnah.edu
1      ahmed.shan@jinnah.edu
2    sana.muzamil@jinnah.edu
Name: email, dtype: object

In [10]:
type(data['email'])

pandas.core.series.Series

#### accessing columns using dot operator

In [20]:
data.email

0       ali.naeem@jinnah.edu
1      ahmed.shan@jinnah.edu
2    sana.muzamil@jinnah.edu
Name: email, dtype: object

In [21]:
data.fname

0      Ali
1    Ahmed
2     Sana
Name: fname, dtype: object

In [13]:
data.lname

0      naeem
1       shan
2    muzamil
Name: lname, dtype: object

In [14]:
data.count

<bound method DataFrame.count of    fname    lname                    email
0    Ali    naeem     ali.naeem@jinnah.edu
1  Ahmed     shan    ahmed.shan@jinnah.edu
2   Sana  muzamil  sana.muzamil@jinnah.edu>

In [15]:
data['count']

KeyError: 'count'

In [19]:
data[['lname','email']]

     lname                    email
0    naeem     ali.naeem@jinnah.edu
1     shan    ahmed.shan@jinnah.edu
2  muzamil  sana.muzamil@jinnah.edu

In [17]:
data.columns

Index(['fname', 'lname', 'email'], dtype='object')

#### get a row --> using iloc / loc

In [18]:
data.iloc[0] #that willl give us 1st row

fname                     Ali
lname                   naeem
email    ali.naeem@jinnah.edu
Name: 0, dtype: object

### passing a list of integer in iloc to print the specified rows

In [22]:
data.iloc[[0,1,2]]

   fname    lname                    email
0    Ali    naeem     ali.naeem@jinnah.edu
1  Ahmed     shan    ahmed.shan@jinnah.edu
2   Sana  muzamil  sana.muzamil@jinnah.edu

In [23]:
data.iloc[[0,1,2],2]

0       ali.naeem@jinnah.edu
1      ahmed.shan@jinnah.edu
2    sana.muzamil@jinnah.edu
Name: email, dtype: object

### with loc we will be searching by label but in iloc we used integer to access values

In [24]:
data

   fname    lname                    email
0    Ali    naeem     ali.naeem@jinnah.edu
1  Ahmed     shan    ahmed.shan@jinnah.edu
2   Sana  muzamil  sana.muzamil@jinnah.edu

In [28]:
data.loc[0,:]

fname                     Ali
lname                   naeem
email    ali.naeem@jinnah.edu
Name: 0, dtype: object

In [26]:
data.loc[[0,1]]

   fname  lname                  email
0    Ali  naeem   ali.naeem@jinnah.edu
1  Ahmed   shan  ahmed.shan@jinnah.edu

In [30]:
data.loc[[0,1],'email']

0     ali.naeem@jinnah.edu
1    ahmed.shan@jinnah.edu
Name: email, dtype: object

In [31]:
data.loc[0:2,['email','fname']]  #check column orders doesn't matter here

                     email  fname
0     ali.naeem@jinnah.edu    Ali
1    ahmed.shan@jinnah.edu  Ahmed
2  sana.muzamil@jinnah.edu   Sana

# Task:
print all the dataset of Hobbiest

Go to --> pandas basics - 01